In [197]:
#import random
import random

In [198]:
#assign 10 values between 20,45
a=[]
for i in range(10):
    value= random.randint(20,45)
    a.append(value)

In [199]:
a

[39, 33, 23, 28, 28, 43, 27, 35, 41, 20]

In [341]:
#list to string convertion
b=["phani","kumar","hari naryana","nikhil kumar"]
string=" ".join(b)

In [342]:
b

['phani', 'kumar', 'hari naryana', 'nikhil kumar']

In [318]:
Data = []
for i in b:
    Data.append(i.split())

In [336]:
Data

[['phani'], ['kumar'], ['hari', 'naryana'], ['nikhil', 'kumar']]

In [333]:
DD = []
for i in Data:
    if len(i)>=2:
        for j in i:
            DD.append(j)
    else:
        DD.append(i[0])

In [334]:
DD

['phani', 'kumar', 'hari', 'naryana', 'nikhil', 'kumar']

In [337]:
[item for sublist in Data for item in sublist]

['phani', 'kumar', 'hari', 'naryana', 'nikhil', 'kumar']

In [347]:
# LIST TO STRING AND JOINT AND SPLIT A NEW LIST
b=["phani","kumar","hari naryana","nikhil kumar"]
string=" ".join(b)
b=[]
b=string.split()

In [348]:
b

['phani', 'kumar', 'hari', 'naryana', 'nikhil', 'kumar']

In [203]:
a

[39, 33, 23, 28, 28, 43, 27, 35, 41, 20]

In [340]:
b

In [205]:
import pandas as pd

In [206]:
#COMBINE TWO COLUMNS IN A DATAFRAME
df=pd.DataFrame(zip(a,b))

In [207]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [208]:
df.shape

(6, 2)

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      int64
 1   1       6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [210]:
df.columns='age','names'

In [211]:
df

   age    names
0   39    phani
1   33    kumar
2   23     hari
3   28  naryana
4   28   nikhil
5   43    kumar

In [216]:
#replcing the  string 
df['names'] = df["names"].replace("naryana","narayana")

In [217]:
df

   age     names
0   39     phani
1   33     kumar
2   23      hari
3   28  narayana
4   28    nikhil
5   43     kumar

In [176]:
names=[]
for i in df['names']:
    if i=='naryana':
        i='narayana'
        names.append(i)

In [177]:
df

   age    names
0   45    phani
1   37    kumar
2   22     hari
3   44  naryana
4   43   nikhil
5   40    kumar

In [178]:
# in a dataframe change a cell value using at (df.at[])
for index,rows in df.iterrows():
    if rows['names']=="naryana":
        df.at[index,'names']="narayana"

In [179]:
df

   age     names
0   45     phani
1   37     kumar
2   22      hari
3   44  narayana
4   43    nikhil
5   40     kumar

In [180]:
salary=[]
for i in range(6):
    sal=random.randint(20000,50000)
    salary.append(sal)

In [181]:
salary

[36530, 34323, 38187, 25546, 25080, 36633]

In [182]:
type(salary)

list

In [183]:
df2=pd.DataFrame(salary)

In [184]:
df2

       0
0  36530
1  34323
2  38187
3  25546
4  25080
5  36633

In [185]:
df

   age     names
0   45     phani
1   37     kumar
2   22      hari
3   44  narayana
4   43    nikhil
5   40     kumar

In [186]:
#new column adding the existing the dataframe
df['Salary'] = salary

In [187]:
df

   age     names  Salary
0   45     phani   36530
1   37     kumar   34323
2   22      hari   38187
3   44  narayana   25546
4   43    nikhil   25080
5   40     kumar   36633

In [188]:
df = df[['names',"age","Salary"]]

In [189]:
df

      names  age  Salary
0     phani   45   36530
1     kumar   37   34323
2      hari   22   38187
3  narayana   44   25546
4    nikhil   43   25080
5     kumar   40   36633

In [190]:
df

      names  age  Salary
0     phani   45   36530
1     kumar   37   34323
2      hari   22   38187
3  narayana   44   25546
4    nikhil   43   25080
5     kumar   40   36633

In [191]:
#sorting the value 
df.sort_values('Salary')

      names  age  Salary
4    nikhil   43   25080
3  narayana   44   25546
1     kumar   37   34323
0     phani   45   36530
5     kumar   40   36633
2      hari   22   38187

In [194]:
# if df.drop(df.sort_values('Salary')<30000):
#     print(df)
df.drop(df[df['Salary']<=30000].index,inplace=True)

C:\Users\SRMAPCSELAB2022-241\AppData\Local\Temp\ipykernel_16760\1876961574.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(df[df['Salary']<=30000].index,inplace=True)

In [195]:
df

   names  age  Salary
0  phani   45   36530
1  kumar   37   34323
2   hari   22   38187
5  kumar   40   36633

In [219]:
chr(65)

'A'

In [227]:
{26-i:chr(j) for i,j in enumerate(range(65,91))}

{26: 'A',
 25: 'B',
 24: 'C',
 23: 'D',
 22: 'E',
 21: 'F',
 20: 'G',
 19: 'H',
 18: 'I',
 17: 'J',
 16: 'K',
 15: 'L',
 14: 'M',
 13: 'N',
 12: 'O',
 11: 'P',
 10: 'Q',
 9: 'R',
 8: 'S',
 7: 'T',
 6: 'U',
 5: 'V',
 4: 'W',
 3: 'X',
 2: 'Y',
 1: 'Z'}

In [266]:
D = {}
for i,j in enumerate(range(65,91)):
    D[i+1] = chr(j)

In [243]:
list(D.values()).sort()

In [271]:
Data = "".join(list(D.values()))
# Data[-1] = Data[-1].lower()
# Data.replace("Z","z")

In [272]:
cars = ['Ford', 'BMW', 'Volvo']

cars.sort(reverse=False)

In [273]:
cars

['BMW', 'Ford', 'Volvo']

In [282]:
Data

'ABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [304]:
D = []
for i in range(len(Data)):
    if i %2 == 0:
        D.append(Data[i])
    else:
        D.append(Data.replace(Data[i],Data[i].lower())[i])

In [305]:
Data

'ABCDEFGHIJKLMNOPQRSTUVWXYZ'

In [307]:
"".join(D)

'AbCdEfGhIjKlMnOpQrStUvWxYz'

In [303]:
a = "Phani"
a[1]

'h'

In [308]:
D = ""
for i in range(len(Data)):
    if i %2 == 0:
        D+=(Data[i])
    else:
        D+=(Data.replace(Data[i],Data[i].lower())[i])

In [309]:
D

'AbCdEfGhIjKlMnOpQrStUvWxYz'

In [2]:
import pandas as pd
df=pd.read_excel(r"C:\Users\SRMAPCSELAB2022-241\Downloads\No due form CSE department.xlsx",sheet_name=None)

In [3]:
df.keys()

dict_keys(['2019 B.Tech', '2020 B.Sc', '2021. M.Tech'])

In [4]:
df=pd.read_excel(r"C:\Users\SRMAPCSELAB2022-241\Downloads\No due form CSE department.xlsx",'2021. M.Tech')

In [22]:
df[:2:]

,S.No,Registration No,Student Name,Gender,Program,Branch,Graduated status,Remarks
1,1,AP21122040001,SHAIK VINSHA,F,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due
2,2,AP21122040002,INGUVA VENKATA KRISHNA ESHWAR,M,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due

In [6]:
df.columns=df.iloc[0]

In [9]:
df.drop(0,axis=0,inplace=True)

In [21]:
df[:2:]

,S.No,Registration No,Student Name,Gender,Program,Branch,Graduated status,Remarks
1,1,AP21122040001,SHAIK VINSHA,F,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due
2,2,AP21122040002,INGUVA VENKATA KRISHNA ESHWAR,M,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due

In [12]:
data=[["one","two"],["three"],["four"],["five"]]

In [15]:
#list of list in a singel list
a=[]
for i in range(len(data)):
    for j in data[i]:
        a.append(j)

In [16]:
a

['one', 'two', 'three', 'four', 'five']

In [20]:
#drop a Remarks column
df[:3:]

,S.No,Registration No,Student Name,Gender,Program,Branch,Graduated status,Remarks
1,1,AP21122040001,SHAIK VINSHA,F,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due
2,2,AP21122040002,INGUVA VENKATA KRISHNA ESHWAR,M,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due
3,3,AP21122040003,INDURI ANUJA,F,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23,No Due

In [27]:
df.drop('Remarks',axis=1,inplace=True)

In [28]:
df[:1:]

,S.No,Registration No,Student Name,Gender,Program,Branch,Graduated status
1,1,AP21122040001,SHAIK VINSHA,F,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23

In [30]:
#drop a multiple columns
df.drop(df[['S.No','Gender']],axis=1,inplace=True)

In [34]:
df[:1:]

,Registration No,Student Name,Program,Branch,Graduated status
1,AP21122040001,SHAIK VINSHA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23

In [37]:
df

,Registration No,Student Name,Program,Branch,Graduated status
1,AP21122040001,SHAIK VINSHA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
2,AP21122040002,INGUVA VENKATA KRISHNA ESHWAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
3,AP21122040003,INDURI ANUJA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
4,AP21122040004,NALLAMOTHU TALANYA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
5,AP21122040005,DHARANI SABARI SAMUDRALA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
6,AP21122040006,SHIVAM DINKAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
7,AP21122040007,MUTUPURI SHIVA SHANKAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
8,AP21122040008,KHADRI SYED FAIZZ AHMAD,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
9,AP21122040009,MADUPURI REDDY PRIYA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
10,AP21122040012,EDAWANBIANG DHAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
11,AP21122040013,AADHAR KAUSHIK,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
12,AP21122040015,JUPUDI ANVITHA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23

In [41]:
display(df)

,Registration No,Student Name,Program,Branch,Graduated status
1,AP21122040001,SHAIK VINSHA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
2,AP21122040002,INGUVA VENKATA KRISHNA ESHWAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
3,AP21122040003,INDURI ANUJA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
4,AP21122040004,NALLAMOTHU TALANYA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
5,AP21122040005,DHARANI SABARI SAMUDRALA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
6,AP21122040006,SHIVAM DINKAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
7,AP21122040007,MUTUPURI SHIVA SHANKAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
8,AP21122040008,KHADRI SYED FAIZZ AHMAD,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
9,AP21122040009,MADUPURI REDDY PRIYA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
10,AP21122040012,EDAWANBIANG DHAR,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
11,AP21122040013,AADHAR KAUSHIK,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23
12,AP21122040015,JUPUDI ANVITHA,M.Tech.,ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING,Yet to be graduated in AY 2022-23